{"backend": "tensorflow", "config": {"name": "sequential", "layers": [{"config": {"dtype": "float32", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "implementation": 1, "kernel_constraint": null, "name": "lstm", "trainable": true, "units": 32, "activity_regularizer": null, "unroll": false, "recurrent_constraint": null, "return_state": false, "batch_input_shape": [null, null, 6], "stateful": false, "dropout": 0.0, "go_backwards": false, "recurrent_dropout": 0.0, "bias_regularizer": null, "return_sequences": false, "unit_forget_bias": true, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "softmax", "kernel_constraint": null, "name": "dense", "trainable": true, "activity_regularizer": null, "units": 3, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.1.6-tf"}